In [1]:
from pyautoml import Clean, Preprocess, Feature
import pandas as pd

train_data = pd.read_csv('data/train.csv')
test_data = pd.read_csv('data/test.csv')

In [2]:
clean = Clean(train_data=train_data, test_data=test_data, target_field='Survived')

## Cleaning

In [3]:
clean.describe()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891,891,891,NaN,NaN,714,891,891,NaN,891,NaN,NaN
mean,446,0.383838,2.30864,NaN,NaN,29.6991,0.523008,0.381594,NaN,32.2042,NaN,NaN
std,257.354,0.486592,0.836071,NaN,NaN,14.5265,1.10274,0.806057,NaN,49.6934,NaN,NaN
min,1,0,1,NaN,NaN,0.42,0,0,NaN,0,NaN,NaN
25%,223.5,0,2,NaN,NaN,20.125,0,0,NaN,7.9104,NaN,NaN
50%,446,0,3,NaN,NaN,28,0,0,NaN,14.4542,NaN,NaN
75%,668.5,1,3,NaN,NaN,38,1,0,NaN,31,NaN,NaN
max,891,1,3,NaN,NaN,80,8,6,NaN,512.329,NaN,NaN
counts,891,891,891,891,891,714,891,891,891,891,204,889
uniques,891,2,3,891,2,88,7,7,681,248,147,3
missing,0,0,0,0,0,177,0,0,0,0,687,2
missing_perc,0%,0%,0%,0%,0%,19.87%,0%,0%,0%,0%,77.10%,0.22%
types,numeric,bool,numeric,unique,bool,numeric,numeric,numeric,categorical,numeric,categorical,categorical

In [4]:
clean.column_info()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
counts,891,891,891,891,891,714,891,891,891,891,204,889
uniques,891,2,3,891,2,88,7,7,681,248,147,3
missing,0,0,0,0,0,177,0,0,0,0,687,2
missing_perc,0%,0%,0%,0%,0%,19.87%,0%,0%,0%,0%,77.10%,0.22%
types,numeric,bool,numeric,unique,bool,numeric,numeric,numeric,categorical,numeric,categorical,categorical

In [7]:
clean.describe_column('Fare')

mean                        32.2042
std                         49.6934
variance                    2469.44
min                               0
max                         512.329
mode                           8.05
5%                            7.225
25%                          7.9104
50%                         14.4542
75%                              31
95%                         112.079
iqr                         23.0896
kurtosis                    33.3981
skewness                    4.78732
sum                         28693.9
mad                         28.1637
cv                          1.54307
zeros_num                        15
zeros_perc                    1.68%
deviating_of_mean                20
deviating_of_mean_perc        2.24%
deviating_of_median              53
deviating_of_median_perc      5.95%
top_correlations
counts                          891
uniques                         248
missing                           0
missing_perc                     0%
types                       numeric
Name: Fare, dtype: object

In [8]:
clean.describe_column('Fare')['mean']

32.204207968574636

In [4]:
clean.missing_values

,Cabin,Age,Embarked,Fare,Ticket,Parch,SibSp,Sex,Name,Pclass,Survived,PassengerId
Total,687.000000,177.000000,2.000000,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
Percent,0.771044,0.198653,0.002245,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

,Cabin,Age,Fare,Embarked,Ticket,Parch,SibSp,Sex,Name,Pclass,PassengerId
Total,327.000000,86.000000,1.000000,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
Percent,0.782297,0.205742,0.002392,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [4]:
# Suppressing output
_, _ = clean.replace_missing_constant('C', ['Embarked'])

In [5]:
clean.missing_values

,Cabin,Age,Embarked,Fare,Ticket,Parch,SibSp,Sex,Name,Pclass,Survived,PassengerId
Total,687.000000,177.000000,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
Percent,0.771044,0.198653,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

,Cabin,Age,Fare,Embarked,Ticket,Parch,SibSp,Sex,Name,Pclass,PassengerId
Total,327.000000,86.000000,1.000000,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
Percent,0.782297,0.205742,0.002392,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [9]:
_, _ = clean.replace_missing_mostcommon(['Fare'])

In [7]:
clean.missing_values

,Cabin,Age,Fare,Embarked,Ticket,Parch,SibSp,Sex,Name,Pclass,Survived,PassengerId
Total,687.000000,177.000000,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
Percent,0.771044,0.198653,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

,Cabin,Age,Fare,Embarked,Ticket,Parch,SibSp,Sex,Name,Pclass,PassengerId
Total,327.000000,86.000000,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
Percent,0.782297,0.205742,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [27]:
clean

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Cabin,Embarked,Fare
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,NaN,S,7.2500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,C85,C,71.2833
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,NaN,S,7.9250
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,C123,S,53.1000
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,NaN,S,8.0500
5,6,0,3,"Moran, Mr. James",male,39.0,0,0,330877,NaN,Q,8.4583
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,NaN,S,21.0750
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,NaN,S,11.1333
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,NaN,C,30.0708
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,G6,S,16.7000
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,NaN,S,8.0500
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,NaN,S,31.2750
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,NaN,S,7.8542
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,NaN,Q,29.1250
17,18,1,2,"Williams, Mr. Charles Eugene",male,19.0,0,0,244373,NaN,S,13.0000
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,NaN,S,18.0000
19,20,1,3,"Masselmani, Mrs. Fatima",female,20.0,0,0,2649,NaN,C,7.2250
20,21,0,2,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,NaN,S,26.0000
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,D56,S,13.0000
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,NaN,Q,8.0292
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,A6,S,35.5000
24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.0,3,1,349909,NaN,S,21.0750
25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,1,5,347077,NaN,S,31.3875
26,27,0,3,"Emir, Mr. Farred Chehab",male,29.0,0,0,2631,NaN,C,7.2250
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,C23 C25 C27,S,263.0000
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,38.0,0,0,330959,NaN,Q,7.8792
29,30,0,3,"Todoroff, Mr. Lalio",male,16.0,0,0,349216,NaN,S,7.8958
30,31,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,PC 17601,NaN,C,27.7208
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,29.0,1,0,PC 17569,B78,C,146.5208
32,33,1,3,"Glynn, Miss. Mary Agatha",female,21.0,0,0,335677,NaN,Q,7.7500
...,...,...,...,...,...,...,...,...,...,...,...,...
860,861,0,3,"Hansen, Mr. Claus Peter",male,41.0,2,0,350026,NaN,S,14.1083
861,862,0,2,"Giles, Mr. Frederick Edward",male,21.0,1,0,28134,NaN,S,11.5000
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,17466,D17,S,25.9292
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,26.0,8,2,CA. 2343,NaN,S,69.5500
864,865,0,2,"Gill, Mr. John William",male,24.0,0,0,233866,NaN,S,13.0000
865,866,1,2,"Bystrom, Mrs. (Karolina)",female,42.0,0,0,236852,NaN,S,13.0000
866,867,1,2,"Duran y More, Miss. Asuncion",female,27.0,1,0,SC/PARIS 2149,NaN,C,13.8583
867,868,0,1,"Roebling, Mr. Washington Augustus II",male,31.0,0,0,PC 17590,A24,S,50.4958
868,869,0,3,"van Melkebeke, Mr. Philemon",male,30.0,0,0,345777,NaN,S,9.5000
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,NaN,S,11.1333
870,871,0,3,"Balkic, Mr. Cerin",male,26.0,0,0,349248,NaN,S,7.8958
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,D35,S,52.5542
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,B51 B53 B55,S,5.0000
873,874,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,NaN,S,9.0000
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,NaN,C,24.0000
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,NaN,C,7.2250
876,877,0,3,"Gustafsson, Mr. Alfred Ossian",male,20.0,0,0,7534,NaN,S,9.8458
877,878,0,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,NaN,S,7.8958
878,879,0,3,"Laleff, Mr. Kristo",male,18.0,0,0,349217,NaN,S,7.8958
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,NaN,S,26.0000
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,NaN,S,7.8958
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,NaN,S,10.5167
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,NaN,S,10.5000
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,NaN,S,7.0500
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,NaN,Q,29.1250
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,NaN,S,13.0000
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,B42,S,30.0000
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,48.0,1,2,W./C. 6607,NaN,S,23.4500
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,C148,C,30.0000
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,NaN,Q,7.7500